import 'package:techblog/gen/assets.gen.dart';
import 'package:techblog/models/data_models.dart';

Map homePagePosterMap = {

"imageAsset" : Assets.images.posterTest.path,
"writer" : "هادی شوکت",
"date" : "یک روز پیش",
"title" : " متن بلند    اینجا نوشته میشود",
"view" : "253"

};


//blog fake data
List<HashTagModel> tagList =[

HashTagModel(title: "جاوا"),
HashTagModel(title: "پادکست هوشمند"),
HashTagModel(title: "وب"),
HashTagModel(title: "هوش مصنوعی"),
HashTagModel(title: "iot"),
HashTagModel(title: "دارت"),


];

List<HashTagModel> selectedTags = [];

List<BlogModel> blogList = [
  BlogModel(
      id: 1,
      imageUrl: "https://s5.uupload.ir/files/hadicell/%D8%B4%D8%AE%D8%B5%DB%8C/0_ZQ9Xa7CINFVMA95w.png",
      title: "فلاتر 3 منتشر شد!",
      writer: "آرش تهرانی",
      writerImageUrl: "https://s5.uupload.ir/files/hadicell/%D8%B4%D8%AE%D8%B5%DB%8C/WhatsApp%20Image%202022-02-11%20at%2022.36.16.jpeg",
      date: "۱ ساعت پیش",
      content: """ تیم توسعه‌‌‌‌‌ٔ فلاتر دیشب در یک اقدام پیش‌بینی نشدنی، از نسخه ۳ فلاتر همراه با دارت ۲.۱۷ در Google I/O 22 رونمایی کرد.
      طبق حرف‌های مدیر محصول فلاتر و تجزیه و تحلیل‌های شرکت‌های تحقیقاتی مثل data.ai و گواهی‌های عمومی، در حال حاضر بیش از ۵۰۰,۰۰۰ برنامه با فلاتر ‌ساخته شده‌؛ از شبکه‌های اجتماعی مثل WeChat تا برنامه‌های مالی و بانکی مثل Betterment و NuBank، از برنامه‌های تجاری مثل SHEIN و trip.com گرفته تا برنامه‌های سبک‌زندگی مثل Fastic و Tabcorp، از برنامه‌های همراه مثل My BMW گرفته تا موسسات عمومی مثل دولت برزیل!

طبق سوالات و آمارها:

۹۱٪ توسعه‌دهندگان فلاتر معتقدن که فلاتر، سرعت توسعه و انتشار برنامه‌هارو کاهش میده!
۸۵٪ گفتند که فلاتر بهشون در ساخت برنامه‌های زیباتری بسازن!
۸۵٪ گفتند که فلاتر باعث شده برنامه‌هاشونو روی بیشتر از ۱ پلتفرم منتشر کنن!
      
        """,
      views: "256"
      ),
  BlogModel(
      id: 2,
      imageUrl: "https://avatars.githubusercontent.com/u/101200292?v=4",
      title: " بهترین مدرس آموزش فلاتر در ایران ",
      writer: "هادی شوکت ",
      writerImageUrl: "https://s5.uupload.ir/files/hadicell/%D8%B4%D8%AE%D8%B5%DB%8C/WhatsApp%20Image%202022-02-11%20at%2022.36.16.jpeg",
      date: "۴ ساعت پیش",
      content:
      """
استاد ساسان صفری یکی از بهترین مدرسین برنامه نویسی موبایل در ایران است.
 دوره صفر تا صد فلاتر یکی از دوره‌های بسیار جذابی است که برای یادگیری فریم‌ورک فلاتر وجود دارد و قطعا شما از استفاده از آن نهایت رضایت  را خواهید داشت. دلایل بسیار زیادی وجود دارد که شما باید از این دوره استفاده کنید که در بخش‌های قبلی برخی از مهم‌ترین آنها را به شما معرفی کردیم. این دوره با کمترین هزینه ممکن به شما ارائه می‌شود و برخلاف بسیاری از دوره‌های دیگر که دارای قیمت بسیار بالایی هستند این دوره نسبت به کیفیتی که به شما ارائه می‌دهد دارای هزینه مناسبی است. همین عامل نیز باعث می‌شود تا تمامی افرادی که علاقه‌مند به یادگیری کارکردن با این فریم‌ورک هستند بتوانند به‌راحتی هرچه تمام مطالب و محتوای این دوره را تهیه کرده و از آن برای یادگیری فلاتر استفاده کنند.

نکته کلیدی و مهم دیگری که باید درباره این دوره بدانید این است که این دوره به‌صورت بسیار کامل و جامع تهیه شده است و شما با استفاده از آن نیازی به هیچ منبع آموزشی دیگری نخواهید داشت. البته نباید فراموش کنید که شما برای موفق شدن در این زمینه و تبدیل‌شدن به یک متخصص فلاتر حتما باید مطالعات جانبی نیز داشته باشید. در طول این دوره سعی می‌کنیم برخی از مهم‌ترین منابعی که امروزه برای افزایش اطلاعات جدید در زمینه فریم‌ورک فلاتر وجود دارند را نیز به شما معرفی کنیم تا در صورت علاقه از آنها استفاده کنید.

صحبت پایانی

دوره صفر تا صد فلاتر یک دوره بسیار جامع و کامل است که می‌تواند به شما کمک کند تا به یک متخصص در زمینه فریم‌ورک فلاتر تبدیل شوید. دوره آموزشی فلاتر (Flutter) دارای ویژگی‌های زیادی است که از جمله آن می‌توان به یادگیری عملی، کیفیت بالای محتوا و هزینه مناسب آن اشاره کرد. اگر شما هم جز آن دسته از افرادی هستید که علاقه‌مند به یادگیری کارکردن با فلاتر برای توسعه اپلیکیشن‌های مختلف هستید به شما پیشنهاد می‌کنیم حتما این دوره را تهیه کرده و از آن استفاده کنید.

برای شرکت در این دوره میتواند وارد سایت زیر شوید:

      """
      ,views: "10M"
  ),
  BlogModel(
      id: 3,
      imageUrl: "https://digiato.com/wp-content/uploads/2022/04/1200-178443098-space-exploration-risks_smaller.jpg",
      title: "کاوشگران سیاره سرخ چگونه به تولید برق در مریخ می‌پردازند؟",
      writer: "مرضیه فرجی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2022/02/10897985_639437109516078_4342420382567329691_n-300x300.jpg",
      date: "",
      content:
      """
انرژی خورشیدی و انرژی هسته‌ای منابع انرژی هستند که تیم‌های کاوشگران در مریخ مورد استفاده قرار می‌دهند. کدام یک بهتر است؟ چطور می‌توان به تولید برق در مریخ پرداخت؟ دانشمندان به این سوالات پاسخ دادند.
محققان برای سفرهای خدمه مریخ به گزینه مختلف تولید انرژی را باهم مقایسه کردند: سلول‌های خورشیدی و انرژی‌ هسته‌ای رآکتورهای شکاف کوچک. یکی از ملاحظات کلیدی در این مطالعه، مقدار وزن یا جرم قابل حمل اجزای مورد نیاز است، زیرا لوازمی که در ماموریت‌های مریخ مورد استفاده قرار می‌گیرند، باید بهینه‌ترین وزن را داشته باشند. نتایج این مطالعه که در « Frontiers in Astronomy and Space Sciences» به چاپ رسید، نشان می‌دهد وابسته به موقعیت جغرافیایی روی سطح سیاره سرخ و شرایط آب و هوایی، روش‌های دست‌یابی به انرژی در مریخ متفاوت خواهد بود.
«آنتونی آبل» محقق دپارتمان مهندسی شیمی دانشگاه «برکلی» و یکی از نویسندگان این مطالعه می‌گوید: «برای تولید برق در مریخ، موقعیت کاوشگر در سطح سیاره عامل تعیین کننده است. اگر به خط استوا نزدیک باشد، استفاده از انرژی خورشیدی توصیه می‌شود و اگر به قطب‌ها نزدیک باشد، بهتر است از انرژی هسته‌ای استفاده شود.»
      """
      ,views: "256"

  ),
  BlogModel(
      id: 4,
      imageUrl: "https://digiato.com/wp-content/uploads/2022/04/13WELLREAD-CACIOPPO-superJumbo.jpg",
      title: "چگونه عشق بر عملکرد مغز ما تاثیر می‌گذارد؟",
      writer: "مرضیه فرجی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2022/02/10897985_639437109516078_4342420382567329691_n-300x300.jpg",
      date: "۱۷ ساعت پیش",
      content:
      """
آیا می‌توانیم بدون عشق زندگی خود را پیش ببریم؟ برای سال‌ها، «استفانی اورتیگ» عصب‌شناس، معتقد بود که پاسخ این سوال مثبت است. با وجود اینکه دکتر اورتیگ در مورد علم ارتباطات انسانی تحقیق می‌کرد، موفق شد اهمیت این ارتباطات را به صورت مستقیم در زندگی خود نیز درک کند.
او در کتاب جدید خود با عنوان « I told myself that being unattached made me a more objective researcher: I could investigate love without being under its spell» می‌نویسد: « به خودم گفتم که عدم وابستگی سبب می‌شود محققی موفق‌تر باشم، می‌توانم بدون آنکه تحت تاثیر قرار بگیرم، در مورد عشق و رابطه تحقیق کنم.»
اما سپس او در سال 2011 و در سن 37 سالگی، «جان کاچیوپو» را در یک کنفرانس علوم اعصاب در «شانگهای» ملاقات کرد. دکتر کاچیوپو، که این مفهوم را رایج کرد که تنهایی طولانی مدت می‌تواند به اندازه سیگار کشیدن برای سلامتی مضر باشد، او را به خود مجذوب کرد.
این دو دانشمند به‌طرز عجیبی در زندگی باهم آشنا شدند و سپس ازدواج کردند. آن‌ها در دانشکده پزشکی «پریتزکر» در شیکاگو با یکدیگر همکار شدند و تیم تحقیقاتی خود را در آزمایشگاه تشکیل دادند.
      """
      ,views: "256"

  ),
  BlogModel(
      id: 5,
      imageUrl: "https://digiato.com/wp-content/uploads/2022/04/cghjm.jpg",
      title: "ساخت اسپیکرهای فوق باریک توسط مهندسان MIT",
      writer: "آرش تهرانی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2022/04/elon-musk-4-90x90.jpg",
      date: "ساعت پیش ۴ ",
      content:
      """
مهندسان دانشگاه MIT به تازگی اسپیکر فوق باریکی را ساخته‌اند که می‌توان آن را مانند کاغذدیواری روی هر سطحی نصب کرد. به گفته تیم مذکور این اسپیکرها مصرف انرژی پایینی دارند و تولید انبوه آن‌ها آسان است.
اگر بخواهیم عملکرد این اسپیکر را به زبان ساده توضیح دهیم بایست بگوییم محصول مذکور از طریق مرتعش کردن دیافراگم اسپیکر، هوای روی آن را به گردش در می‌آورد تا امواج صوتی تولید کند، امری که در باقی اسپیکرها و سیستم‌های صوتی به وسیله جریان‌های الکتریکی و میدان‌های مغناطیسی انجام می‌شود.
با این وجود دانشمندان در سال‌های اخیر توانستند با ایجاد روش‌های متفاوت، در دستگاه‌های بسیار باریک به نتایج مشابهی دست پیدا کنند. برای مثال اسپیکرهای «فیلم باریک» از مواد پیزوالکتریک استفاده می‌کنند که در پاسخ به تغییر ولتاژ مرتعش می‌شود.
مشکل اما اینجاست که این دسته از اسپیکرهای باریک یا بایست حالت ایستاده و آزاد داشته باشند، یا اینکه با کمی فاصله از سطوح دیگر در جای خود قرار بگیرند زیرا نصب کردن‌شان موجب کاهش قابلیت ارتعاش و تولید صوت در آنها می‌شود.
      """
      ,views: "256"

  ),
  BlogModel(
      id: 6,
      imageUrl: "https://digiato.com/wp-content/uploads/2022/04/photo_2022-04-29_09-37-59.jpg",
      title: "ایلان ماسک حدود 4 میلیارد دلار از سهام تسلا را فروخت",
      writer: "هادی شوکت",
      writerImageUrl: "https://s5.uupload.ir/files/hadicell/%D8%B4%D8%AE%D8%B5%DB%8C/WhatsApp%20Image%202022-02-11%20at%2022.36.16.jpeg",
      date: "۱ ساعت پیش",
      content: """
      بر اساس اسناد و پرونده‌های نظارتی منتشر شده، «ایلان ماسک» مدیرعامل تسلا، حدود 4.4 میلیون سهام خود از غول خودروسازی را به ارزش 4 میلیارد دلار در روز سه‌شنبه فروخته است.
طبق گزارش‌های منتشر شده، ماسک در مجموع پنج فرم 4 را به کمیسیون بورس و اوراق بهادار ایالات متحده (SEC) ارائه کرده که تمام 138 تراکنش فردی او را پوشش می‌دهد. بر اساس محاسبات TechCrunch، ارزش سهام فروخته شده، نزدیک به 4 میلیارد دلار است. به گزارش رویترز، این میزان معادل 2.6 درصد از سهام او در تسلا محسوب می‌شود
      """
      ,views: "256"
),
  BlogModel(
      id: 7,
      imageUrl: "https://digiato.com/wp-content/uploads/2022/04/photo_2022-04-29_09-06-13.jpg",
      title: "گزارش درآمد فصل دوم سال مالی 2022 اپل منتشر شد؛ رشد 9 درصدی درآمد",
      writer: "جواد تاجی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
      date: "۴ ساعت پیش",
      content:
      """
هرچند اپل همچنان با محدودیت‌های عرضه دست و پنجه نرم می‌کند، اما در گزارش درآمد سه ماهه دوم سال مالی خود، بهترین فصل منتهی به مارس را در تاریخش گزارش کرد. غول فناوری در این سه ماهه، 97.3 میلیارد دلار درآمد داشته که نسبت به مدت زمان مشابه در سال گذشته، 9 درصد افزایش یافته است. همچنین سود این شرکت 25 میلیارد دلار و سود هر سهم آن 1.52 دلار بوده است.
      """
      ,views: "256"

  ),
  BlogModel(
      id: 8,
      imageUrl: "https://digiato.com/wp-content/uploads/2022/04/1200-178443098-space-exploration-risks_smaller.jpg",
      title: "کاوشگران سیاره سرخ چگونه به تولید برق در مریخ می‌پردازند؟",
      writer: "مرضیه فرجی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2022/02/10897985_639437109516078_4342420382567329691_n-300x300.jpg",
      date: "",
      content:
      """
انرژی خورشیدی و انرژی هسته‌ای منابع انرژی هستند که تیم‌های کاوشگران در مریخ مورد استفاده قرار می‌دهند. کدام یک بهتر است؟ چطور می‌توان به تولید برق در مریخ پرداخت؟ دانشمندان به این سوالات پاسخ دادند.
محققان برای سفرهای خدمه مریخ به گزینه مختلف تولید انرژی را باهم مقایسه کردند: سلول‌های خورشیدی و انرژی‌ هسته‌ای رآکتورهای شکاف کوچک. یکی از ملاحظات کلیدی در این مطالعه، مقدار وزن یا جرم قابل حمل اجزای مورد نیاز است، زیرا لوازمی که در ماموریت‌های مریخ مورد استفاده قرار می‌گیرند، باید بهینه‌ترین وزن را داشته باشند. نتایج این مطالعه که در « Frontiers in Astronomy and Space Sciences» به چاپ رسید، نشان می‌دهد وابسته به موقعیت جغرافیایی روی سطح سیاره سرخ و شرایط آب و هوایی، روش‌های دست‌یابی به انرژی در مریخ متفاوت خواهد بود.
«آنتونی آبل» محقق دپارتمان مهندسی شیمی دانشگاه «برکلی» و یکی از نویسندگان این مطالعه می‌گوید: «برای تولید برق در مریخ، موقعیت کاوشگر در سطح سیاره عامل تعیین کننده است. اگر به خط استوا نزدیک باشد، استفاده از انرژی خورشیدی توصیه می‌شود و اگر به قطب‌ها نزدیک باشد، بهتر است از انرژی هسته‌ای استفاده شود.»
      """
      ,views: "256"

  ),
  BlogModel(
      id: 9,
      imageUrl: "https://digiato.com/wp-content/uploads/2022/04/13WELLREAD-CACIOPPO-superJumbo.jpg",
      title: "چگونه عشق بر عملکرد مغز ما تاثیر می‌گذارد؟",
      writer: "مرضیه فرجی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2022/02/10897985_639437109516078_4342420382567329691_n-300x300.jpg",
      date: "۱۷ ساعت پیش",
      content:
      """
آیا می‌توانیم بدون عشق زندگی خود را پیش ببریم؟ برای سال‌ها، «استفانی اورتیگ» عصب‌شناس، معتقد بود که پاسخ این سوال مثبت است. با وجود اینکه دکتر اورتیگ در مورد علم ارتباطات انسانی تحقیق می‌کرد، موفق شد اهمیت این ارتباطات را به صورت مستقیم در زندگی خود نیز درک کند.
او در کتاب جدید خود با عنوان « I told myself that being unattached made me a more objective researcher: I could investigate love without being under its spell» می‌نویسد: « به خودم گفتم که عدم وابستگی سبب می‌شود محققی موفق‌تر باشم، می‌توانم بدون آنکه تحت تاثیر قرار بگیرم، در مورد عشق و رابطه تحقیق کنم.»
اما سپس او در سال 2011 و در سن 37 سالگی، «جان کاچیوپو» را در یک کنفرانس علوم اعصاب در «شانگهای» ملاقات کرد. دکتر کاچیوپو، که این مفهوم را رایج کرد که تنهایی طولانی مدت می‌تواند به اندازه سیگار کشیدن برای سلامتی مضر باشد، او را به خود مجذوب کرد.
این دو دانشمند به‌طرز عجیبی در زندگی باهم آشنا شدند و سپس ازدواج کردند. آن‌ها در دانشکده پزشکی «پریتزکر» در شیکاگو با یکدیگر همکار شدند و تیم تحقیقاتی خود را در آزمایشگاه تشکیل دادند.
      """
      ,views: "256"

  ),
  BlogModel(
      id: 10,
      imageUrl: "https://digiato.com/wp-content/uploads/2022/04/cghjm.jpg",
      title: "ساخت اسپیکرهای فوق باریک توسط مهندسان MIT",
      writer: "آرش تهرانی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2022/04/elon-musk-4-90x90.jpg",
      date: "ساعت پیش ۴ ",
      content:
      """
مهندسان دانشگاه MIT به تازگی اسپیکر فوق باریکی را ساخته‌اند که می‌توان آن را مانند کاغذدیواری روی هر سطحی نصب کرد. به گفته تیم مذکور این اسپیکرها مصرف انرژی پایینی دارند و تولید انبوه آن‌ها آسان است.
اگر بخواهیم عملکرد این اسپیکر را به زبان ساده توضیح دهیم بایست بگوییم محصول مذکور از طریق مرتعش کردن دیافراگم اسپیکر، هوای روی آن را به گردش در می‌آورد تا امواج صوتی تولید کند، امری که در باقی اسپیکرها و سیستم‌های صوتی به وسیله جریان‌های الکتریکی و میدان‌های مغناطیسی انجام می‌شود.
با این وجود دانشمندان در سال‌های اخیر توانستند با ایجاد روش‌های متفاوت، در دستگاه‌های بسیار باریک به نتایج مشابهی دست پیدا کنند. برای مثال اسپیکرهای «فیلم باریک» از مواد پیزوالکتریک استفاده می‌کنند که در پاسخ به تغییر ولتاژ مرتعش می‌شود.
مشکل اما اینجاست که این دسته از اسپیکرهای باریک یا بایست حالت ایستاده و آزاد داشته باشند، یا اینکه با کمی فاصله از سطوح دیگر در جای خود قرار بگیرند زیرا نصب کردن‌شان موجب کاهش قابلیت ارتعاش و تولید صوت در آنها می‌شود.
      """
      ,views: "256"

  ),
  BlogModel(
      id: 11,
      imageUrl: "https://digiato.com/wp-content/uploads/2022/04/photo_2022-04-29_09-37-59.jpg",
      title: "ایلان ماسک حدود 4 میلیارد دلار از سهام تسلا را فروخت",
      writer: "جواد تاجی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
      date: "۱ ساعت پیش",
      content: """
      بر اساس اسناد و پرونده‌های نظارتی منتشر شده، «ایلان ماسک» مدیرعامل تسلا، حدود 4.4 میلیون سهام خود از غول خودروسازی را به ارزش 4 میلیارد دلار در روز سه‌شنبه فروخته است.
طبق گزارش‌های منتشر شده، ماسک در مجموع پنج فرم 4 را به کمیسیون بورس و اوراق بهادار ایالات متحده (SEC) ارائه کرده که تمام 138 تراکنش فردی او را پوشش می‌دهد. بر اساس محاسبات TechCrunch، ارزش سهام فروخته شده، نزدیک به 4 میلیارد دلار است. به گزارش رویترز، این میزان معادل 2.6 درصد از سهام او در تسلا محسوب می‌شود
      """
      ,views: "256"

),
  BlogModel(
      id: 12,
      imageUrl: "https://digiato.com/wp-content/uploads/2022/04/photo_2022-04-29_09-06-13.jpg",
      title: "گزارش درآمد فصل دوم سال مالی 2022 اپل منتشر شد؛ رشد 9 درصدی درآمد",
      writer: "جواد تاجی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
      date: "۴ ساعت پیش",
      content:
      """
هرچند اپل همچنان با محدودیت‌های عرضه دست و پنجه نرم می‌کند، اما در گزارش درآمد سه ماهه دوم سال مالی خود، بهترین فصل منتهی به مارس را در تاریخش گزارش کرد. غول فناوری در این سه ماهه، 97.3 میلیارد دلار درآمد داشته که نسبت به مدت زمان مشابه در سال گذشته، 9 درصد افزایش یافته است. همچنین سود این شرکت 25 میلیارد دلار و سود هر سهم آن 1.52 دلار بوده است.
      """
      ,views: "256"

  ),
  BlogModel(
      id: 13,
      imageUrl: "https://digiato.com/wp-content/uploads/2022/04/1200-178443098-space-exploration-risks_smaller.jpg",
      title: "کاوشگران سیاره سرخ چگونه به تولید برق در مریخ می‌پردازند؟",
      writer: "مرضیه فرجی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2022/02/10897985_639437109516078_4342420382567329691_n-300x300.jpg",
      date: "",
      content:
      """
انرژی خورشیدی و انرژی هسته‌ای منابع انرژی هستند که تیم‌های کاوشگران در مریخ مورد استفاده قرار می‌دهند. کدام یک بهتر است؟ چطور می‌توان به تولید برق در مریخ پرداخت؟ دانشمندان به این سوالات پاسخ دادند.
محققان برای سفرهای خدمه مریخ به گزینه مختلف تولید انرژی را باهم مقایسه کردند: سلول‌های خورشیدی و انرژی‌ هسته‌ای رآکتورهای شکاف کوچک. یکی از ملاحظات کلیدی در این مطالعه، مقدار وزن یا جرم قابل حمل اجزای مورد نیاز است، زیرا لوازمی که در ماموریت‌های مریخ مورد استفاده قرار می‌گیرند، باید بهینه‌ترین وزن را داشته باشند. نتایج این مطالعه که در « Frontiers in Astronomy and Space Sciences» به چاپ رسید، نشان می‌دهد وابسته به موقعیت جغرافیایی روی سطح سیاره سرخ و شرایط آب و هوایی، روش‌های دست‌یابی به انرژی در مریخ متفاوت خواهد بود.
«آنتونی آبل» محقق دپارتمان مهندسی شیمی دانشگاه «برکلی» و یکی از نویسندگان این مطالعه می‌گوید: «برای تولید برق در مریخ، موقعیت کاوشگر در سطح سیاره عامل تعیین کننده است. اگر به خط استوا نزدیک باشد، استفاده از انرژی خورشیدی توصیه می‌شود و اگر به قطب‌ها نزدیک باشد، بهتر است از انرژی هسته‌ای استفاده شود.»
      """
      ,views: "256"

  ),
  BlogModel(
      id: 14,
      imageUrl: "https://digiato.com/wp-content/uploads/2022/04/13WELLREAD-CACIOPPO-superJumbo.jpg",
      title: "چگونه عشق بر عملکرد مغز ما تاثیر می‌گذارد؟",
      writer: "مرضیه فرجی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2022/02/10897985_639437109516078_4342420382567329691_n-300x300.jpg",
      date: "۱۷ ساعت پیش",
      content:
      """
آیا می‌توانیم بدون عشق زندگی خود را پیش ببریم؟ برای سال‌ها، «استفانی اورتیگ» عصب‌شناس، معتقد بود که پاسخ این سوال مثبت است. با وجود اینکه دکتر اورتیگ در مورد علم ارتباطات انسانی تحقیق می‌کرد، موفق شد اهمیت این ارتباطات را به صورت مستقیم در زندگی خود نیز درک کند.
او در کتاب جدید خود با عنوان « I told myself that being unattached made me a more objective researcher: I could investigate love without being under its spell» می‌نویسد: « به خودم گفتم که عدم وابستگی سبب می‌شود محققی موفق‌تر باشم، می‌توانم بدون آنکه تحت تاثیر قرار بگیرم، در مورد عشق و رابطه تحقیق کنم.»
اما سپس او در سال 2011 و در سن 37 سالگی، «جان کاچیوپو» را در یک کنفرانس علوم اعصاب در «شانگهای» ملاقات کرد. دکتر کاچیوپو، که این مفهوم را رایج کرد که تنهایی طولانی مدت می‌تواند به اندازه سیگار کشیدن برای سلامتی مضر باشد، او را به خود مجذوب کرد.
این دو دانشمند به‌طرز عجیبی در زندگی باهم آشنا شدند و سپس ازدواج کردند. آن‌ها در دانشکده پزشکی «پریتزکر» در شیکاگو با یکدیگر همکار شدند و تیم تحقیقاتی خود را در آزمایشگاه تشکیل دادند.
      """
      ,views: "256"

  ),
  BlogModel(
      id: 15,
      imageUrl: "https://digiato.com/wp-content/uploads/2022/04/cghjm.jpg",
      title: "ساخت اسپیکرهای فوق باریک توسط مهندسان MIT",
      writer: "آرش تهرانی",
      writerImageUrl: "https://digiato.com/wp-content/uploads/2022/04/elon-musk-4-90x90.jpg",
      date: "ساعت پیش ۴ ",
      content:
      """
مهندسان دانشگاه MIT به تازگی اسپیکر فوق باریکی را ساخته‌اند که می‌توان آن را مانند کاغذدیواری روی هر سطحی نصب کرد. به گفته تیم مذکور این اسپیکرها مصرف انرژی پایینی دارند و تولید انبوه آن‌ها آسان است.
اگر بخواهیم عملکرد این اسپیکر را به زبان ساده توضیح دهیم بایست بگوییم محصول مذکور از طریق مرتعش کردن دیافراگم اسپیکر، هوای روی آن را به گردش در می‌آورد تا امواج صوتی تولید کند، امری که در باقی اسپیکرها و سیستم‌های صوتی به وسیله جریان‌های الکتریکی و میدان‌های مغناطیسی انجام می‌شود.
با این وجود دانشمندان در سال‌های اخیر توانستند با ایجاد روش‌های متفاوت، در دستگاه‌های بسیار باریک به نتایج مشابهی دست پیدا کنند. برای مثال اسپیکرهای «فیلم باریک» از مواد پیزوالکتریک استفاده می‌کنند که در پاسخ به تغییر ولتاژ مرتعش می‌شود.
مشکل اما اینجاست که این دسته از اسپیکرهای باریک یا بایست حالت ایستاده و آزاد داشته باشند، یا اینکه با کمی فاصله از سطوح دیگر در جای خود قرار بگیرند زیرا نصب کردن‌شان موجب کاهش قابلیت ارتعاش و تولید صوت در آنها می‌شود.
      """
      ,views: "256"

  ),
  BlogModel(
      id: 16,
      imageUrl: "",
      title: "",
      writer: "",
      writerImageUrl: "",
      date: "",
      content:
      """
      """
      ,views: "256"

  ) 
];


List<PodcastModel> podcastList = [

  PodcastModel(
    id: 1, 
    imageUrl: "https://shenoto-album.s3.ir-thr-at1.arvanstorage.com/52bb7cfc-8aa2-4e61-b01e-0eae61f5aa15/cover/500.jpg", 
    title: "دارما پادکست",
    writer: "الهه رعوفی"),
  PodcastModel(
    id: 2, 
    imageUrl: "https://digiato.com/wp-content/uploads/2022/04/ESA-rendering-released-.jpg", 
    title: " پادکست فضا",
    writer: "محمد رعوفی"),
  PodcastModel(
    id: 2, 
    imageUrl: "https://digiato.com/wp-content/uploads/2022/04/photo_2022-04-29_09-06-13.jpg", 
    title: " مکست",
    writer: "امیر رعوفی"),
  PodcastModel(
    id: 3, 
    imageUrl: "https://shenoto-album.s3.ir-thr-at1.arvanstorage.com/52bb7cfc-8aa2-4e61-b01e-0eae61f5aa15/cover/500.jpg", 
    title: "دارما پادکست",
    writer: "الهه رعوفی"),
  PodcastModel(
    id: 4, 
    imageUrl: "https://digiato.com/wp-content/uploads/2022/04/ESA-rendering-released-.jpg", 
    title: " پادکست فضا",
    writer: "محمد رعوفی"),
  PodcastModel(
    id: 5, 
    imageUrl: "https://digiato.com/wp-content/uploads/2022/04/photo_2022-04-29_09-06-13.jpg", 
    title: " مکست",
    writer: "امیر رعوفی"),
  PodcastModel(
    id: 6, 
    imageUrl: "https://shenoto-album.s3.ir-thr-at1.arvanstorage.com/52bb7cfc-8aa2-4e61-b01e-0eae61f5aa15/cover/500.jpg", 
    title: "دارما پادکست",
    writer: "الهه رعوفی"),
  PodcastModel(
    id: 7, 
    imageUrl: "https://digiato.com/wp-content/uploads/2022/04/ESA-rendering-released-.jpg", 
    title: " پادکست فضا",
    writer: "محمد رعوفی"),
  PodcastModel(
    id: 8, 
    imageUrl: "https://digiato.com/wp-content/uploads/2022/04/photo_2022-04-29_09-06-13.jpg", 
    title: " مکست",
    writer: "امیر رعوفی"),

];
